Ran Plan for project: `sharedservices-prod` dir: `accounts/backstage-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_ecs_cluster.backstage will be updated in-place
~ resource "aws_ecs_cluster" "backstage" {
        id       = "arn:aws:ecs:us-east-2:825765422855:cluster/backstage-cluster"
        name     = "backstage-cluster"
      ~ tags     = {
          + "Name" = "backstage-cluster"
        }
      ~ tags_all = {
          + "Name"       = "backstage-cluster"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.backstage will be created
+ resource "aws_ecs_service" "backstage" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-east-2:825765422855:cluster/backstage-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "backstage-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "DeployedBy" = "Terraform"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "backstage"
          + container_port   = 7000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/1f6e70dc5592d02c"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0000bd3857a940879",
            ]
          + subnets          = [
              + "subnet-0294c64baa3a5a213",
              + "subnet-04aab4266c81237e6",
            ]
        }
    }

  # aws_ecs_task_definition.backstage will be created
+ resource "aws_ecs_task_definition" "backstage" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "APP_CONFIG_app_baseUrl"
                          + value = "https://backstage.feedutopia.com"
                        },
                      + {
                          + name  = "APP_CONFIG_backend_baseUrl"
                          + value = "https://backstage.feedutopia.com"
                        },
                      + {
                          + name  = "AWS_REGION"
                          + value = "us-east-2"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "POSTGRES_DATABASE"
                          + value = "backstage"
                        },
                      + {
                          + name  = "POSTGRES_HOST"
                          + value = "terraform-20250315011313408000000006.c1a2wycw0b5j.us-east-2.rds.amazonaws.com"
                        },
                      + {
                          + name  = "POSTGRES_PASSWORD"
                          + value = "ReallySecurePassword123!"
                        },
                      + {
                          + name  = "POSTGRES_USER"
                          + value = "backstage_user"
                        },
                      + {
                          + name  = "TECHDOCS_S3_BUCKET"
                          + value = "backstage-techdocs-feedutopia"
                        },
                    ]
                  + image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/backstage-repo@sha256:a177f578d67e890c783189c40399351262a3a632b714bfa0ab4afae4ff4fc8d4"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/backstage"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "backstage"
                        }
                    }
                  + name             = "backstage"
                  + portMappings     = [
                      + {
                          + containerPort = 700
                          + hostPort      = 700
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::825765422855:role/backstage-ecs-execution-role"
      + family                   = "backstage-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "DeployedBy" = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::825765422855:role/backstage-ecs-task-role"
      + track_latest             = false
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fbackstage-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```